""" Texts for Telegram-bot """
INFO_TEXT = 'ВНИМАНИЕ!!!\nБот был создан исключительно для осведомления людей о мошенниках, пожалуйста, не ' \
            'используйте полученные данные в корыстных целях, используйте их для защиты своего кошелька, всем мир!☮' \
            '\n\nДля того чтобы узнать, находится ли человек в базе данных мошенников, нажмите на кнопку  "🔭Найти' \
            ' пользователя"💸\nЕсли же вы стали жертвой обмана и хотите чтобы другие люди тоже были осведомлены о' \
            ' мошеннике, подайте на него жалобу, нажав на кнопку "📝Подать жалобу" и введите запрашиваемую от вас ' \
            'информацию, после чего эти жалобы рассмотрят администраторы🔬\n\n🖍Чтобы подать жалобу на администраторов' \
            '/в технический раздел - писать в Telegram @puffy22\n*Если человека нет в базе данных мошенников, это ' \
            'не значит что он не мошенник. Тогда появляется резонный вопрос: "Зачем нужен бот?". Ответ: он усложняет' \
            ' жизнь мошенникам в сфере продажи/обмена/покупки коллекционных карт, так как может предотвратить ' \
            'деятельность серийного мошенника🕵️‍♂️'
START_TEXT = 'Выберите нужный вам раздел🗄'
REPORT_TEXT = 'Выберите раздел жалоб🔣'
FIND_TEXT = 'Выберите данные, по которым вы хотите проверить человека🔍'
CANCEL_TEXT = 'Вы отменили выбранное вами действие🚫'
VK_TEXT = '➰Введите ссылку мошенника из ВКонтакте в таком формате:\nhttps://vk.com/id0'
TG_TEXT = '🗳Введите ID мошенника из Telegram без "@". Пример ввода пользователя "@puffy22":\npuffy22'
CARD_TEXT = '🪙Введите номер карты мошенника в таком формате (Пример ввода карты с номером "1234 5678 9101 1121"):' \
            '\n1234567891011121'
TELEPHONE_TEXT = '☎Введите номер телефона мошенника с кодом на "+". Пример ввода номера +7(800)098-76-54:\n' \
                 '+78000987654\nПример ввода номера +1098-765-4321:\n+10987654321'
ADDRESS_TEXT_P1 = '🏡Введите следующие данные, без всяких дополнений по типу "г.", "кв." и тд.:'
ADDRESS_TEXT_P2 = 'Страна (Пример подачи страны Казахстан: Казахстан):'
ELSE_TEXT = 'Такой команды не найдено, пожалуйста, пользуйтесь кнопками!⛔'
USER_FIND_TEXT_P1 = '🔗Мошенник найден! Его ID в базе данных:\n'
USER_NFIND_TEXT = 'Мошенник не найден. Есть ли у вас ещё данные об этом человеке и/или его ID в базе данных?🎦'
ADD_TEXT = 'Проверьте присутствие информации человека в базе данных, если она есть, то вы сможете дополнить их к ' \
           'определённому мошеннику🔎'
DELETE_TEXT = 'Введите ID пользователя, которого вы хотите удалить из базы данных🔓'
WRONG_TEXT = 'Данные слишком длинные или короткие, либо введена неправильная форма или содежутся запрещённые символы,' \
             " такие как <<'>>!📏"
ID_TEXT = 'Введите ID мошенника🧩'
BACK_TEXT = 'Вы успешно вернулись назад!🔃'
USER_FIND_TEXT_P2 = '\n\nНе забудьте проверить присутствие данных, если у вас имеются ещё'
YES_TEXT = 'Тогда проверьте и их присутствие в базе данных🛢'
DOC_TEXT = '📼Хорошо, предоставьте, пожалуйста, доказательства его нарушения, отправив ссылку на YouTube видео.\n\n' \
           'ПРАВИЛА ПОДАЧИ:\n1. На видео должна быть переписка, где видно что вас обманули, а так же данные мошенника' \
           '\n2. Нужно обновить переписку:\n2.1. Если вы записываете с телефона, то перезайти в неё\n2.2. Если с ' \
           'компьютера, то можно перезайти или просто обновить страницу\n3. Так же, продолжая это видео, зайдите на ' \
           'сайт https://time100.ru/ и обновите его на видео\n\nВидео-пример и форма подачи жалобы:\n' \
           'https://www.youtube.com/watch?v=dQw4w9WgXcQ'
YOUTUBE_C = 'https://www.youtube.com/'
YOUTUBE_CN = 'http://www.youtube.com/'
YOUTUBE_CM = 'https://m.youtube.com/'
YOUTUBE_CMN = 'http://m.youtube.com/'
VK_CM = 'https://m.vk.com/'
VK_CMN = 'http://m.vk.com/'
VK_C = 'https://vk.com/'
VK_CN = 'http://vk.com/'
DOCS_TEXT = 'Доказательства были успешно загружены📔'
NO_ID = 'Такой ID в базе данных отсутствует!🟥'
COUNTRY_TEXT = '🌆Отлично, теперь введите город (Пример ввода города Караганда: Караганда):'
CITY_TEXT = '🏞Отлично, теперь введите улицу (Пример ввода улицы Маршала Жукова Г.К.: Маршала Жукова Г.К.):'
STREET_TEXT = '🏰Отлично, теперь введите дом (Пример ввода дома под номером 69: 69):'
HOME_TEXT = '🚪Отлично, теперь введите квартиру (Пример ввода квартиры под номером 3: 3. Если квартиры нет, то ставьте' \
            ' прочерк "-"):'
